In [6]:
import pandas as pd

data = ['red', 'blue', 'green','green','red','blue']
df = pd.DataFrame(data, columns=['color'])
print(df)

   color
0    red
1   blue
2  green
3  green
4    red
5   blue

In [7]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [8]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [9]:
lbl_encoder.fit_transform(df[['color']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [10]:
lbl_encoder.transform([['red']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:134: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [11]:
lbl_encoder.transform([['green']])

array([1])

In [12]:
lbl_encoder.transform([['blue']])

array([0])

In [ ]:
### Ordinal Encoding

In [13]:
import pandas as pd

In [14]:
from sklearn.preprocessing import OrdinalEncoder

In [15]:
df = pd.DataFrame({
    'size':['small','medium','large','medium','small','large']
})

In [16]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [17]:
## create an instance of OrdinalEncoder and the fit_transform
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [18]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [19]:
encoder.transform([['small']])

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

In [ ]:
## Target Guided Ordinal Encoding

In [20]:
import pandas as pd

df = pd.DataFrame({
    'city' : ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price' : [200,150,300,250,180,320]
})

In [21]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [23]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [24]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [25]:
df['city_encoded']=df['city'].map(mean_price)

In [26]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [27]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0